app/Controllers/AuthController.php

    public function login()
    {
        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        $user = $this->userModel->where('user_name', $username)
                               ->where('user_status', 'active')
                               ->first();

        if ($user && password_verify($password, $user['user_password'])) {
            $sessionData = [
                'user_id' => $user['user_id'],
                'user_name' => $user['user_name'],
                'user_role' => $user['user_role'],
                'logged_in' => TRUE
            ];

            session()->set($sessionData);

            if ($user['user_role'] == 'admin') {
                return redirect()->to(base_url('admin/dashboard'));
            } else {
                return redirect()->to(base_url('staff/dashboard'));
            }
        } else {
            $inactiveUser = $this->userModel->where('user_name', $username)
                                            ->where('user_status !=', 'active')
                                            ->first();
---
SELECT *
FROM `users`
WHERE `user_name` = 'joko'
AND `user_status` = 'active'
 LIMIT 1
SELECT *
FROM `users`
WHERE `user_name` = 'joko'
AND `user_status` != 'active'
 LIMIT 1