app/Controllers/CustomerController.php

    public function store()
    {
        // Define validation rules
        $rules = [
            'customer_name' => 'required',
            'customer_phone' => 'required|numeric|min_length[10]',
            'customer_address' => 'required',
            'customer_status' => 'required|in_list[active,inactive]',
        ];

        if (!$this->validate($rules)) {
            return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
        }

        // Check if the phone number  already exists for active customers
        $existingcustomer = $this->customerModel
            ->where('customer_phone', $this->request->getPost('customer_phone'))
            ->where('customer_status', 'active')
            ->first();

        if ($existingcustomer) {
            return redirect()->back()->withInput()->with('errors', ['customer_phone' => 'Phone number is already in use by an active customer.']);
---
SELECT *
FROM `customers`
WHERE `customer_status` = 'active'
 LIMIT 10