app/Controllers/CustomerController.php

    public function index()
    {
        // Set pagination configuration
        $pager = \Config\Services::pager();

        // Get current page from the request, default to 1 if not set
        $page = $this->request->getGet('page') ?? 1;

        // Get entries per page (default to 10 if not set)
        // Cast to integer to avoid type errors in the limit() method
        $perPage = (int)($this->request->getGet('entries') ?? 10);

        // Get search term (if any)
        $search = $this->request->getGet('search');

        // Base query
        $query = $this->customerModel->where('customer_status', 'active');

        // Apply search filter if set
        if ($search) {
            $query = $query->groupStart()
                    ->like('customer_name', $search)
                    ->orLike('customer_phone', $search)
                    ->orLike('customer_address', $search)
                    ->groupEnd();
        }

        // Get total count based on filters
        $totalCustomers = $query->countAllResults(false);
---
SELECT *
FROM `customers`
WHERE `customer_status` = 'active'
SELECT COUNT(*) AS `numrows`
FROM `customers`
WHERE `customer_status` = 'active'