app/Controllers/HomeController.php

    public function staffDashboard()
    {
        if (!session()->get('logged_in') || session()->get('user_role') != 'staff') {
            return redirect()->to('login');
        }

        // Load user data into session
        $this->loadUserData();

        // Initialize models
        $customerModel = new CustomerModel();
        $productModel = new ProductModel();
        $saleModel = new SaleModel();

        // Get counts for dashboard widgets
        $data['totalCustomers'] = $customerModel->countAll();
        $data['totalProducts'] = $productModel->countAll();

        // Get count of today's sales
        $todayDate = date('Y-m-d');
        $data['todaySales'] = $saleModel->where('DATE(created_at)', $todayDate)->countAllResults();

        // Calculate today's revenue
        $todayRevenue = $saleModel->selectSum('sale_amount')
                                  ->where('DATE(created_at)', $todayDate)
                                  ->where('transaction_status', 'completed')
                                  ->first();
        $data['todayRevenue'] = $todayRevenue['sale_amount'] ?? 0;

        // Get recent sales for the table
        $data['recentSales'] = $saleModel->select('sales.*, customers.customer_name')
                                         ->join('customers', 'customers.customer_id = sales.customer_id')
                                         ->orderBy('sales.created_at', 'DESC')
                                         ->limit(5)
                                         ->find();

        // Get low stock products with category info
        $data['lowStockProducts'] = $productModel->select('products.*, product_categories.product_category_name')
                                                ->join('product_categories', 'product_categories.product_category_id = products.product_category_id')
                                                ->where('products.product_stock <', 10)
                                                ->where('products.product_status', 'active')
                                                ->orderBy('products.product_stock', 'ASC')
                                                ->limit(5)
                                                ->find();

        // Get recent customers
        $data['recentCustomers'] = $customerModel->where('customer_status', 'active')
                                                ->orderBy('created_at', 'DESC')
                                                ->limit(2)
                                                ->find();
---
SELECT COUNT(*) AS `numrows` FROM `customers`
SELECT COUNT(*) AS `numrows` FROM `products`
SELECT COUNT(*) AS `numrows`
FROM `sales`
WHERE DATE(created_at) = '2025-03-05'
SELECT SUM(`sale_amount`) AS `sale_amount`
FROM `sales`
WHERE DATE(created_at) = '2025-03-05'
AND `transaction_status` = 'completed'
 LIMIT 1
SELECT `sales`.*, `customers`.`customer_name`
FROM `sales`
JOIN `customers` ON `customers`.`customer_id` = `sales`.`customer_id`
ORDER BY `sales`.`created_at` DESC
 LIMIT 5
SELECT `products`.*, `product_categories`.`product_category_name`
FROM `products`
JOIN `product_categories` ON `product_categories`.`product_category_id` = `products`.`product_category_id`
WHERE `products`.`product_stock` < 10
AND `products`.`product_status` = 'active'
ORDER BY `products`.`product_stock` ASC
 LIMIT 5
SELECT *
FROM `customers`
WHERE `customer_status` = 'active'
ORDER BY `created_at` DESC
 LIMIT 2