app/Controllers/ProductController.php

    public function index()
    {
        // Get all active products with related category and supplier
        $products = $this->productModel
                    ->select('products.product_id, products.product_name, products.selling_price, products.product_stock,
                             products.unit_per_box, products.box_selling_price, products.box_bought,
                             product_categories.product_category_name, suppliers.supplier_name')
                    ->join('product_categories', 'product_categories.product_category_id = products.product_category_id')
                    ->join('suppliers', 'suppliers.supplier_id = products.supplier_id')
                    ->where('product_status', 'active') // Only get active products
                    ->findAll();
---
SELECT `products`.`product_id`, `products`.`product_name`, `products`.`selling_price`, `products`.`product_stock`, `products`.`unit_per_box`, `products`.`box_selling_price`, `products`.`box_bought`, `product_categories`.`product_category_name`, `suppliers`.`supplier_name`
FROM `products`
JOIN `product_categories` ON `product_categories`.`product_category_id` = `products`.`product_category_id`
JOIN `suppliers` ON `suppliers`.`supplier_id` = `products`.`supplier_id`
WHERE `product_status` = 'active'