app/Controllers/ProductController.php

    public function edit($productId)
    {
        // Get product data by product_id
        $product = $this->productModel->find($productId);

        if (!$product) {
            throw new \CodeIgniter\Exceptions\PageNotFoundException('Product not found');
        }

        // Get the list of categories
        $categories = $this->categoryModel->findAll();

        // Get only active suppliers
        $suppliers = $this->supplierModel->where('supplier_status', 'active')->findAll();
---
SELECT *
FROM `products`
WHERE `products`.`product_id` = 'PDT000031'
SELECT *
FROM `suppliers`
WHERE `supplier_status` = 'active'