app/Controllers/ProfileController.php

SELECT *
FROM `users`
WHERE `users`.`user_id` = 'USR000001'
---
    public function edit()
    {
        if (!session()->get('logged_in')) {
            return redirect()->to('login');
        }

        $userId = session()->get('user_id');
        $data['user'] = $this->userModel->find($userId);