app/Controllers/PurchaseController.php

        // Get user and supplier information for each purchase
        foreach ($purchases as &$purchase) {
            // Get user name based on user_id (already joined but keep just in case)
            $user = $userModel->find($purchase['user_id']);
            $purchase['user_fullname'] = $user ? $user['user_fullname'] : 'Unknown';

            // Get supplier name and phone based on supplier_id (already joined but keep just in case)
            $supplier = $supplierModel->find($purchase['supplier_id']);
---
SELECT *
FROM `users`
WHERE `users`.`user_id` = 'USR000002'
SELECT *
FROM `suppliers`
WHERE `suppliers`.`supplier_id` = 'SUP000004'

    public function details($purchaseId)
    {
        $purchaseModel = new PurchaseModel();
        $purchaseDetailModel = new PurchaseDetailModel();
        $userModel = new UserModel();
        $supplierModel = new SupplierModel();
        $productModel = new ProductModel();

        // Mendapatkan data purchase berdasarkan ID
        $data['purchase'] = $purchaseModel->find($purchaseId);

        // Jika data purchase tidak ditemukan, redirect dengan pesan error
        if (!$data['purchase']) {
            return redirect()->to('/admin/purchases')->with('error', 'Purchase not found.');
        }

        // Mendapatkan nama pembeli (user) berdasarkan user_id
        $user = $userModel->find($data['purchase']['user_id']);
        $data['purchase']['user_name'] = $user ? $user['user_fullname'] : 'Unknown user';

        // Mendapatkan nama supplier berdasarkan supplier_id
        $supplier = $supplierModel->find($data['purchase']['supplier_id']);
        $data['purchase']['supplier_name'] = $supplier ? $supplier['supplier_name'] : 'Unknown';
        $data['purchase']['supplier_phone'] = $supplier ? $supplier['supplier_phone'] : 'Unknown';

        // Mendapatkan detail pembelian berdasarkan purchase_id
        $data['purchase_details'] = $purchaseDetailModel->where('purchase_id', $purchaseId)->findAll();
---
SELECT *
FROM `purchases`
WHERE `purchases`.`purchase_id` = 'PUR000015'
SELECT *
FROM `users`
WHERE `users`.`user_id` = 'USR000001'
SELECT *
FROM `suppliers`
WHERE `suppliers`.`supplier_id` = 'SUP000009'
SELECT *
FROM `purchase_details`
WHERE `purchase_id` = 'PUR000015'

        // Menambahkan nama produk ke dalam setiap detail pembelian
        foreach ($data['purchase_details'] as &$detail) {
            // Mendapatkan data produk berdasarkan product_id
            $product = $productModel->find($detail['product_id']);
---
SELECT *
FROM `products`
WHERE `products`.`product_id` = 'PDT000021'

    public function updateStatus($purchaseId, $newStatus)
    {
        // Verify the purchase ID exists
        $purchaseModel = new PurchaseModel();
        $purchase = $purchaseModel->find($purchaseId);
---
SELECT *
FROM `purchases`
WHERE `purchases`.`purchase_id` = 'PUR000023'

        }

        // Update the purchase status
        $purchaseModel->update($purchaseId, $updateData);
---
UPDATE `purchases` SET `order_status` = 'completed', `updated_at` = '2025-03-07 07:44:29'
WHERE `purchases`.`purchase_id` IN ('PUR000023')

    private function updateProductStockAndPrice($purchaseId)
    {
        $purchaseDetailModel = new PurchaseDetailModel();
        $productModel = new ProductModel();

        // Get all purchase details for this purchase
        $purchaseDetails = $purchaseDetailModel->where('purchase_id', $purchaseId)->findAll();

        foreach ($purchaseDetails as $detail) {
            // Get the current product data
            $product = $productModel->find($detail['product_id']);
---
SELECT *
FROM `purchase_details`
WHERE `purchase_id` = 'PUR000023'
SELECT *
FROM `products`
WHERE `products`.`product_id` = 'PDT000011'

            }

            // Update the product with new stock and buying price
            $productModel->update($detail['product_id'], [
                'product_stock' => $newTotalStock,
                'buying_price' => $newAverageBuyingPrice,
                'updated_at' => date('Y-m-d H:i:s')
            ]);
---
UPDATE `products` SET `product_stock` = 80, `buying_price` = 24500, `updated_at` = '2025-03-07 07:44:29'
WHERE `products`.`product_id` IN ('PDT000011')