app/Controllers/PurchaseController.php

        $totalPurchases = $query->countAllResults(false);

        // Get paginated purchases based on filters
        $purchases = $query->orderBy('purchases.updated_at', 'DESC')
                    ->limit($perPage, ($page - 1) * $perPage)
                    ->findAll();
---
SELECT COUNT(*) AS `numrows`
FROM `purchases`
SELECT *
FROM `purchases`
ORDER BY `purchases`.`updated_at` DESC
 LIMIT 10

    public function details($purchaseId)
    {
        $purchaseModel = new PurchaseModel();
        $purchaseDetailModel = new PurchaseDetailModel();
        $userModel = new UserModel();
        $supplierModel = new SupplierModel();
        $productModel = new ProductModel();

        // Mendapatkan data purchase berdasarkan ID
        $data['purchase'] = $purchaseModel->find($purchaseId);

        // Jika data purchase tidak ditemukan, redirect dengan pesan error
        if (!$data['purchase']) {
            return redirect()->to('/admin/purchases')->with('error', 'Purchase not found.');
        }

        // Mendapatkan nama pembeli (buyer) berdasarkan user_id
        $user = $userModel->find($data['purchase']['user_id']);
        $data['purchase']['buyer_name'] = $user ? $user['user_fullname'] : 'Unknown Buyer';

        // Mendapatkan nama supplier berdasarkan supplier_id
        $supplier = $supplierModel->find($data['purchase']['supplier_id']);
        $data['purchase']['supplier_name'] = $supplier ? $supplier['supplier_name'] : 'Unknown';
        $data['purchase']['supplier_phone'] = $supplier ? $supplier['supplier_phone'] : 'Unknown';

        // Mendapatkan detail pembelian berdasarkan purchase_id
        $data['purchase_details'] = $purchaseDetailModel->where('purchase_id', $purchaseId)->findAll();
---
SELECT *
FROM `purchases`
WHERE `purchases`.`purchase_id` = 'PUR000024'
SELECT *
FROM `purchase_details`
WHERE `purchase_id` = 'PUR000024'

        // Menambahkan nama produk ke dalam setiap detail pembelian
        foreach ($data['purchase_details'] as &$detail) {
            // Mendapatkan data produk berdasarkan product_id
            $product = $productModel->find($detail['product_id']);
---
SELECT *
FROM `products`
WHERE `products`.`product_id` = 'PDT000026'