app/Controllers/PurchaseController.php

SELECT *
FROM `purchases`
SELECT *
FROM `users`
WHERE `users`.`user_id` = 'USR000001'
SELECT *
FROM `suppliers`
WHERE `suppliers`.`supplier_id` = 'SUP000001'
---
    public function index()
    {
        $purchaseModel = new PurchaseModel();
        $userModel = new UserModel();
        $supplierModel = new SupplierModel();

        // Mendapatkan semua data purchase
        $data['purchases'] = $purchaseModel->findAll();

        // Mendapatkan nama supplier, nama user dan kontak (supplier_phone) untuk setiap purchase
        foreach ($data['purchases'] as &$purchase) {
            // Ambil nama user berdasarkan user_id
            $user = $userModel->find($purchase['user_id']);
            $purchase['user_fullname'] = $user ? $user['user_fullname'] : 'Unknown';

            // Ambil nama supplier berdasarkan supplier_id
            $supplier = $supplierModel->find($purchase['supplier_id']);

SELECT *
FROM `purchases`
WHERE `purchases`.`purchase_id` = 'PUR959991'
SELECT *
FROM `users`
WHERE `users`.`user_id` = 'USR000001'
SELECT *
FROM `suppliers`
WHERE `suppliers`.`supplier_id` = 'SUP000001'
SELECT *
FROM `purchase_details`
WHERE `purchase_id` = 'PUR959991'
---
    public function details($purchaseId)
    {
        $purchaseModel = new PurchaseModel();
        $purchaseDetailModel = new PurchaseDetailModel();
        $userModel = new UserModel();
        $supplierModel = new SupplierModel();
        $productModel = new ProductModel();

        // Mendapatkan data purchase berdasarkan ID
        $data['purchase'] = $purchaseModel->find($purchaseId);

        // Jika data purchase tidak ditemukan, redirect dengan pesan error
        if (!$data['purchase']) {
            return redirect()->to('/admin/purchases')->with('error', 'Purchase not found.');
        }

        // Mendapatkan nama pembeli (buyer) berdasarkan user_id
        $user = $userModel->find($data['purchase']['user_id']);
        $data['purchase']['buyer_name'] = $user ? $user['user_fullname'] : 'Unknown Buyer';

        // Mendapatkan nama supplier berdasarkan supplier_id
        $supplier = $supplierModel->find($data['purchase']['supplier_id']);
        $data['purchase']['supplier_name'] = $supplier ? $supplier['supplier_name'] : 'Unknown';
        $data['purchase']['supplier_phone'] = $supplier ? $supplier['supplier_phone'] : 'Unknown';

        // Mendapatkan detail pembelian berdasarkan purchase_id
        $data['purchase_details'] = $purchaseDetailModel->where('purchase_id', $purchaseId)->findAll();

SELECT *
FROM `suppliers`
WHERE `suppliers`.`supplier_id` = 'SUP000001'
---
    public function selectProducts($supplierId)
    {
        $productModel = new ProductModel();
        $supplierModel = new SupplierModel();

        // Fetch supplier data
        $data['supplier'] = $supplierModel->find($supplierId);