app/Controllers/SaleController.php

        $totalSales = $query->countAllResults(false);

        // Get paginated sales based on filters
        $sales = $query->orderBy('sales.updated_at', 'DESC')
                    ->limit($perPage, ($page - 1) * $perPage)
                    ->findAll();
---
SELECT COUNT(*) AS `numrows`
FROM `sales`
SELECT *
FROM `sales`
ORDER BY `sales`.`updated_at` DESC
 LIMIT 10

        // Get user and customer information for each sale
        foreach ($sales as &$sale) {
            // Get user fullname based on user_id
            $user = $userModel->find($sale['user_id']);
            $sale['user_fullname'] = $user ? $user['user_fullname'] : 'Unknown';

            // Get customer name and phone based on customer_id
            $customer = $customerModel->find($sale['customer_id']);
---
SELECT *
FROM `users`
WHERE `users`.`user_id` = 'USR000001'
SELECT *
FROM `customers`
WHERE `customers`.`customer_id` = 'CUS000001'

    public function selectProducts($customerId)
    {
        $productModel = new ProductModel();
        $customerModel = new CustomerModel();

        // Fetch customer data
        $data['customer'] = $customerModel->find($customerId);
        if (!$data['customer']) {
            return redirect()->to('/sales/customer')->with('error', 'Customer not found.');
---
SELECT *
FROM `customers`
WHERE `customers`.`customer_id` = 'CUS000021'

    public function updateStatus($saleId, $newStatus)
    {
        // Verify the sale ID exists
        $saleModel = new SaleModel();
        $sale = $saleModel->find($saleId);
---
SELECT *
FROM `sales`
WHERE `sales`.`sale_id` = 'SAL000031'

        $db->transStart();

        // Update the sale status
        $saleModel->update($saleId, [
            'transaction_status' => $newStatus,
            'updated_at' => date('Y-m-d H:i:s')
        ]);
---
UPDATE `sales` SET `transaction_status` = 'processing', `updated_at` = '2025-03-07 07:47:16'
WHERE `sales`.`sale_id` IN ('SAL000031')