app/Controllers/SalesReportController.php

SELECT *
FROM `sales`
WHERE `created_at` >= '2025-01-01 00:00:00'
AND `created_at` <= '2025-12-31 23:59:59'
AND `transaction_status` = 'completed'
---
    public function generateReport()
    {
        // Get date parameters
        $startDate = $this->request->getPost('start_date');
        $endDate = $this->request->getPost('end_date');

        // Initialize models
        $saleModel = new SaleModel();
        $userModel = new UserModel();
        $customerModel = new CustomerModel();
        $saleDetailModel = new SaleDetailModel();
        $productModel = new ProductModel();

        // Filter by date range and completed status
        $saleQuery = $saleModel->where('updated_at >=', $startDate . ' 00:00:00')
                              ->where('updated_at <=', $endDate . ' 23:59:59')
                              ->where('transaction_status', 'completed') // Filter for completed sales only
                              ->orderBy('updated_at', 'ASC'); // Order by date from oldest to newest

        // Set period title
        $periodTitle = 'Period: ' . date('d M Y', strtotime($startDate)) . ' - ' . date('d M Y', strtotime($endDate));

        // Get sales data based on filter
        $sales = $saleQuery->findAll();

SELECT *
FROM `users`
WHERE `users`.`user_id` = 'USR000001'
SELECT *
FROM `customers`
WHERE `customers`.`customer_id` = 'CUS000001'
---
            $totalAmount += $sale['sale_amount'];

            // Get user name based on user_id
            $user = $userModel->find($sale['user_id']);
            $sale_info['user_fullname'] = $user ? $user['user_fullname'] : 'Unknown';

            // Get customer name based on customer_id
            $customer = $customerModel->find($sale['customer_id']);

SELECT *
FROM `sale_details`
WHERE `sale_id` = 'SAL000001'
SELECT *
FROM `products`
WHERE `products`.`product_id` = 'PDT000001'
---
            $customerStats[$sale['customer_id']]['count']++;

            // Get product details
            $sale_details = $saleDetailModel->where('sale_id', $sale['sale_id'])->findAll();
            $sale_info['products'] = [];

            foreach ($sale_details as $detail) {
                $product = $productModel->find($detail['product_id']);