app/Controllers/SaleController.php

    public function index()
    {
        $saleModel = new SaleModel();
        $userModel = new UserModel();
        $customerModel = new CustomerModel();

        // Set pagination configuration
        $pager = \Config\Services::pager();

        // Get current page from the request, default to 1 if not set
        $page = $this->request->getGet('page') ?? 1;

        // Set items per page
        $perPage = 10;

        // Get total count of sales
        $totalSales = $saleModel->countAllResults();

        // Get paginated sales
        $sales = $saleModel
               ->orderBy('created_at', 'DESC')
               ->limit($perPage, ($page - 1) * $perPage)
               ->findAll();

        // Get user and customer information for each sale
        foreach ($sales as &$sale) {
            // Get user fullname based on user_id
            $user = $userModel->find($sale['user_id']);
            $sale['user_fullname'] = $user ? $user['user_fullname'] : 'Unknown';

            // Get customer name and phone based on customer_id
            $customer = $customerModel->find($sale['customer_id']);
---
SELECT *
FROM `users`
WHERE `users`.`user_id` = 'USR000001'
SELECT *
FROM `customers`
WHERE `customers`.`customer_id` = 'CUS000001'

    public function store()
    {
        // Get the POST data for the sale
        $postData = $this->request->getPost();

        // Ensure 'products' exists and is an array
        if (empty($postData['products']) || !is_array($postData['products'])) {
            return redirect()->back()->with('error', 'Please select at least one product.');
        }

        // Filter out any empty product entries
        $selectedProducts = array_filter($postData['products'], function($product) {
            return !empty($product['product_id']);
        });

        if (empty($selectedProducts)) {
            return redirect()->back()->with('error', 'Please select at least one product.');
        }

        // Generate a unique sale_id by checking existing ones
        $saleModel = new SaleModel();
        $saleDetailModel = new SaleDetailModel();
        $productModel = new ProductModel();

        // Find the last sale and increment the number for the new sale
        $lastSale = $saleModel->orderBy('sale_id', 'desc')->first();
---
SELECT *
FROM `sales`
WHERE `sales`.`sale_id` = 'SAL000024'