app/Controllers/SupplierController.php

    public function index()
    {
        if (!session()->get('logged_in') || session()->get('user_role') != 'admin') {
            return redirect()->to('login');
        }

        // Set pagination configuration
        $pager = \Config\Services::pager();

        // Get current page from the request, default to 1 if not set
        $page = $this->request->getGet('page') ?? 1;

        // Set items per page
        $perPage = 10;

        // Get total count of active suppliers
        $totalSuppliers = $this->supplierModel
                         ->where('supplier_status', 'active')
                         ->countAllResults();

        // Get paginated suppliers
        $suppliers = $this->supplierModel
                   ->where('supplier_status', 'active')
                   ->limit($perPage, ($page - 1) * $perPage)
                   ->find();
---
SELECT COUNT(*) AS `numrows`
FROM `suppliers`
WHERE `supplier_status` = 'active'
SELECT *
FROM `suppliers`
WHERE `supplier_status` = 'active'
 LIMIT 10