app/Controllers/SupplierController.php

SELECT *
FROM `suppliers`
WHERE `suppliers`.`supplier_id` = 'SUP000001'
---
    public function store()
    {
        if (!session()->get('logged_in') || session()->get('user_role') != 'admin') {
            return redirect()->to('login');
        }

        // Define validation rules
        $rules = [
            'supplier_name' => 'required',
            'supplier_phone' => 'required|numeric|min_length[10]',
            'supplier_address' => 'required',
            'supplier_status' => 'required|in_list[active,inactive]',
        ];

        if (!$this->validate($rules)) {
            return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
        }

        // Check if the phone number  already exists for active suppliers
        $existingSupplier = $this->supplierModel
            ->where('supplier_phone', $this->request->getPost('supplier_phone'))
            ->where('supplier_status', 'active')
            ->first();

        if ($existingSupplier) {
            return redirect()->back()->withInput()->with('errors', ['supplier_phone' => 'Phone number is already in use by an active supplier.']);
        }

        // Generate supplier ID
        $lastSupplier = $this->supplierModel->orderBy('supplier_id', 'DESC')->first();