app/Controllers/UserController.php

SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `user_status` = 'active'
SELECT *
FROM `users`
WHERE `user_status` = 'active'
 LIMIT 10
---
    public function index()
    {
        if (!session()->get('logged_in') || session()->get('user_role') != 'admin') {
            return redirect()->to('login');
        }

        // Set pagination configuration
        $pager = \Config\Services::pager();

        // Get current page from the request, default to 1 if not set
        $page = $this->request->getGet('page') ?? 1;

        // Set items per page
        $perPage = 10;

        // Get total count of active users
        $totalUsers = $this->userModel
                     ->where('user_status', 'active')
                     ->countAllResults();

        // Get paginated users
        $users = $this->userModel
                ->where('user_status', 'active')
                ->limit($perPage, ($page - 1) * $perPage)
                ->find();

SELECT *
FROM `users`
WHERE `user_status` = 'active'
AND `user_id` != 'USR000001'
ORDER BY `updated_at` DESC
 LIMIT 10
---
    public function store()
    {
        if (!session()->get('logged_in') || session()->get('user_role') != 'admin') {
            return redirect()->to('login');
        }

        // Define validation rules
        $rules = [
            'username' => 'required|min_length[3]',
            'password' => 'required|min_length[6]',
            'fullname' => 'required',
            'phone' => 'permit_empty|numeric|min_length[10]',
            'role' => 'required|in_list[admin,staff]',
            'status' => 'required|in_list[active,inactive]'
        ];

        if (!$this->validate($rules)) {
            return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
        }

        // Check if phone number exists for active users (ignoring inactive ones)
        $existingUser = $this->userModel->where('user_phone', $this->request->getPost('phone'))
                                        ->where('user_status', 'active')
                                        ->first();

        if ($existingUser) {
            return redirect()->back()->withInput()->with('errors', ['phone' => 'Phone number is already in use by an active user.']);
        }

        // Generate user ID
        $lastUser = $this->userModel->orderBy('user_id', 'DESC')->first();

SELECT *
FROM `users`
WHERE `users`.`user_id` = 'USR000002'
---
    public function edit($id)
    {
        if (!session()->get('logged_in') || session()->get('user_role') != 'admin') {
            return redirect()->to('login');
        }

        $data['user'] = $this->userModel->find($id);

SELECT *
FROM `users`
WHERE `users`.`user_id` = 'USR000002'
---
    public function update($id)
    {
        if (!session()->get('logged_in') || session()->get('user_role') != 'admin') {
            return redirect()->to('login');
        }

        $user = $this->userModel->find($id);

        if (!$user) {
            session()->setFlashdata('error', 'User tidak ditemukan');
            return redirect()->to('admin/users');
        }

        // Define validation rules
        $rules = [
            'username' => 'required|min_length[3]',
            'fullname' => 'required',
            'phone' => 'permit_empty|numeric|min_length[10]',
            'role' => 'required|in_list[admin,staff]',
            'status' => 'required|in_list[active,inactive]'
        ];

        // Check if phone number exists for active users (ignoring inactive ones)
        if ($this->request->getPost('phone') != $user['user_phone']) {
            $existingUser = $this->userModel->where('user_phone', $this->request->getPost('phone'))
                                            ->where('user_status', 'active')
                                            ->first();

            if ($existingUser) {
                return redirect()->back()->withInput()->with('errors', ['phone' => 'Phone number is already in use by an active user.']);